pe089/system/sample

sampling
{
    type                    sets;
    libs                    (sampling);
    setFormat               raw;
    interpolationScheme     cellPoint;
    fields                  (T p rho U);
    writeControl            timeStep;
    writeInterval           1;
    log                     on;
    enabled                 true;

    sets
    (
        probeline
        {
            type        uniform;
            axis        distance;
            start       (0      0 0);
            end         (0.254  0 0);
            nPoints     301;
        }
    );
}

